cloudn1ne/Mowgli/stm32/ros_usbnode/src/main.c
/*
 * Project Mowgli - STM32 ROS SERIAL USB
 * (c) Cybernet / cn@warp.at
 * 
 *  Version 1.0 
 *  
 *  compile with -DBOARD_YARDFORCE500 to enable the YF500 GForce pinout
 * 
 *  ROS integration howto taken from here: https://github.com/Itamare4/ROS_stm32f1_rosserial_USB_VCP (Itamar Eliakim)
 *  
 */

#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_uart.h"
#include "stm32f1xx_hal_adc.h"
#include "main.h"
#include <stdio.h>
#include <stdarg.h>
#include <string.h>
// stm32 custom
#include "board.h"
#include "panel.h"
#include "soft_i2c.h"
#include "imu/imu.h"
#include "lis3dh_reg.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "nbt.h"

// ros
#include "cpp_main.h"
#include "ringbuffer.h"

static int32_t platform_write(void *handle, uint8_t reg, const uint8_t *bufp,
                              uint16_t len);
static int32_t platform_read(void *handle, uint8_t reg, uint8_t *bufp,
                             uint16_t len);


static nbt_t main_chargecontroller_nbt;
static nbt_t main_statusled_nbt;

enum rx_status_enum { RX_WAIT, RX_VALID, RX_CRC_ERROR};

// DRIVEMOTORS rx buffering
static uint8_t drivemotors_rcvd_data;
uint8_t  drivemotors_rx_buf[32];
volatile uint32_t drivemotors_rx_buf_idx = 0;
uint8_t  drivemotors_rx_buf_crc = 0;
uint8_t  drivemotors_rx_LENGTH = 0;
uint8_t  drivemotors_rx_CRC = 0;
volatile uint8_t  drivemotors_rx_STATUS = RX_WAIT;
// DRIVEMOTORS tx buffering
volatile uint8_t  drivemotors_tx_busy = 0;
static uint8_t drivemotors_tx_buffer_len;
static char drivemotors_tx_buffer[32];



// MASTER rx buffering
static uint8_t master_rcvd_data;
volatile uint8_t  master_rx_buf[32];
volatile uint32_t master_rx_buf_idx = 0;
volatile uint8_t  master_rx_buf_crc = 0;
volatile uint8_t  master_rx_LENGTH = 0;
volatile uint8_t  master_rx_CRC = 0;
volatile uint8_t  master_rx_STATUS = RX_WAIT;
// MASTER tx buffering
volatile uint8_t  master_tx_busy = 0;
static uint8_t master_tx_buffer_len;
static char master_tx_buffer[255];



int    blade_motor = 0;

static uint8_t panel_rcvd_data;

// exported via rostopics
float_t battery_voltage;
float_t charge_voltage;
float_t charge_current;
uint16_t chargecontrol_pwm_val=MIN_CHARGE_PWM;
uint8_t  chargecontrol_is_charging=0;
uint32_t right_encoder_ticks=0;
uint32_t left_encoder_ticks=0;
int8_t left_direction=0;
int8_t right_direction=0;
uint16_t right_encoder_val=0;
uint16_t left_encoder_val=0;
int16_t right_wheel_speed_val=0;
int16_t left_wheel_speed_val=0;
int8_t prev_left_direction=0;
int8_t prev_right_direction=0;
uint16_t prev_right_encoder_val=0;
uint16_t prev_left_encoder_val=0;
int16_t prev_right_wheel_speed_val=0;
int16_t prev_left_wheel_speed_val=0;


UART_HandleTypeDef MASTER_USART_Handler; // UART  Handle
UART_HandleTypeDef DRIVEMOTORS_USART_Handler; // UART  Handle
UART_HandleTypeDef BLADEMOTOR_USART_Handler; // UART  Handle

// Drive Motors DMA
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;
DMA_HandleTypeDef hdma_uart4_tx;

I2C_HandleTypeDef I2C_Handle;
ADC_HandleTypeDef ADC_Handle;
TIM_HandleTypeDef TIM1_Handle;  // PWM Charge Controller
TIM_HandleTypeDef TIM3_Handle;  // PWM Beeper

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
   // do nothing here
}

/*
 * called when DMA transfer completes
 * update <xxxx>_tx_busy to let XXXX_Transmit function now when the DMA buffer is free 
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{   
    if (huart->Instance == MASTER_USART_INSTANCE)
    {
        if (__HAL_USART_GET_FLAG(&MASTER_USART_Handler, USART_FLAG_TC))        
        {
            master_tx_busy = 0;
        }
    }
    if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
    {
        if (__HAL_USART_GET_FLAG(&DRIVEMOTORS_USART_Handler, USART_FLAG_TC))        
        {
            drivemotors_tx_busy = 0;
        }
    }
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
   // do nothing here
}

/*
 * Master UART receive ISR
 * DriveMotors UART receive ISR
 * PANEL UART receive ISR
 */ 
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{           
       if (huart->Instance == MASTER_USART_INSTANCE)
       {
           /*
            * MASTER Message handling
            */
           if (master_rx_buf_idx == 0 && master_rcvd_data == 0x55)           /* PREAMBLE */  
           {                                  
               master_rx_buf_crc = master_rcvd_data;        
               master_rx_buf[master_rx_buf_idx++] = master_rcvd_data;                                   
           }           
           else if (master_rx_buf_idx == 1 && master_rcvd_data == 0xAA)        /* PREAMBLE */    
           {                   
               master_rx_buf_crc += master_rcvd_data;
               master_rx_buf[master_rx_buf_idx++] = master_rcvd_data;               
           }
           else if (master_rx_buf_idx == 2) /* LEN */
           {    
               master_rx_LENGTH = master_rcvd_data;
               master_rx_buf[master_rx_buf_idx++] = master_rcvd_data;               
               master_rx_buf_crc += master_rcvd_data;                              
           }
           else if (master_rx_buf_idx >= 3 && master_rx_buf_idx <= 2+master_rx_LENGTH) /* DATA bytes */
           {
               master_rx_buf[master_rx_buf_idx] = master_rcvd_data;
               master_rx_buf_idx++;
               master_rx_buf_crc += master_rcvd_data;               
           }
           else if (master_rx_buf_idx >= 3+master_rx_LENGTH)    /* CRC byte */
           {
               master_rx_CRC = master_rcvd_data;
               master_rx_buf[master_rx_buf_idx] = master_rcvd_data;
               master_rx_buf_idx++;               
               if (master_rx_buf_crc == master_rcvd_data)
               {                   
                   // message valid, reader must set back STATUS to RX_WAIT
                   master_rx_STATUS = RX_VALID;
                   //master_rx_buf_idx = 0;
               }
               else
               {                   
                   // crc failed, reader must set back STATUS to RX_WAIT
                   master_rx_STATUS = RX_WAIT;                   
                   master_rx_buf_idx = 0;
               }
           }
           else
           {
               master_rx_STATUS = RX_WAIT;
               master_rx_buf_idx = 0;               
           }           
       //    HAL_UART_Receive_IT(&MASTER_USART_Handler, &master_rcvd_data, 1);   // rearm interrupt           
       }
       else if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
       {
         /*
            * DRIVE MOTORS Message handling
            */
           if (drivemotors_rx_buf_idx == 0 && drivemotors_rcvd_data == 0x55)           /* PREAMBLE */  
           {                                   
               drivemotors_rx_buf_crc = drivemotors_rcvd_data;        
               drivemotors_rx_buf[drivemotors_rx_buf_idx++] = drivemotors_rcvd_data;                                   
           }           
           else if (drivemotors_rx_buf_idx == 1 && drivemotors_rcvd_data == 0xAA)        /* PREAMBLE */    
           {                                  
               drivemotors_rx_buf_crc += drivemotors_rcvd_data;
               drivemotors_rx_buf[drivemotors_rx_buf_idx++] = drivemotors_rcvd_data;               
           }
           else if (drivemotors_rx_buf_idx == 2) /* LEN */
           {    
               drivemotors_rx_LENGTH = drivemotors_rcvd_data;
               drivemotors_rx_buf[drivemotors_rx_buf_idx++] = drivemotors_rcvd_data;               
               drivemotors_rx_buf_crc += drivemotors_rcvd_data;                              
           }
           else if (drivemotors_rx_buf_idx >= 3 && drivemotors_rx_buf_idx <= 2+drivemotors_rx_LENGTH) /* DATA bytes */
           {
               drivemotors_rx_buf[drivemotors_rx_buf_idx] = drivemotors_rcvd_data;
               drivemotors_rx_buf_idx++;
               drivemotors_rx_buf_crc += drivemotors_rcvd_data;               
           }
           else if (drivemotors_rx_buf_idx >= 3+drivemotors_rx_LENGTH)    /* CRC byte */
           {
               drivemotors_rx_CRC = drivemotors_rcvd_data;
               drivemotors_rx_buf[drivemotors_rx_buf_idx] = drivemotors_rcvd_data;
               drivemotors_rx_buf_idx++;               
               if (drivemotors_rx_buf_crc == drivemotors_rcvd_data)
               {                   
                   // message valid, reader must set back STATUS to RX_WAIT
                   drivemotors_rx_STATUS = RX_VALID;
                   //drivemotors_rx_buf_idx = 0;
               }
               else
               {                   
                   // crc failed, reader must set back STATUS to RX_WAIT
                   drivemotors_rx_STATUS = RX_CRC_ERROR;                   
                   drivemotors_rx_buf_idx = 0;
               }
           }
           else
           {
               drivemotors_rx_STATUS = RX_WAIT;
               drivemotors_rx_buf_idx = 0;               
           }       
       }       
       else if(huart->Instance == PANEL_USART_INSTANCE)
       {
           PANEL_Handle_Received_Data(panel_rcvd_data);
           HAL_UART_Receive_IT(&PANEL_USART_Handler, &panel_rcvd_data, 1);   // rearm interrupt               
       }
}


int main(void)
{    
    uint8_t blademotor_init[] =  { 0x55, 0xaa, 0x12, 0x20, 0x80, 0x00, 0xac, 0x0d, 0x00, 0x02, 0x32, 0x50, 0x1e, 0x04, 0x00, 0x15, 0x21, 0x05, 0x0a, 0x19, 0x3c, 0xaa };    
    uint8_t drivemotors_init[] = { 0x55, 0xaa, 0x08, 0x10, 0x80, 0xa0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x37};

    HAL_Init();
    SystemClock_Config();

    __HAL_RCC_AFIO_CLK_ENABLE();    

    MX_DMA_Init();
    
    MASTER_USART_Init();

    debug_printf("\r\n");
    debug_printf("    __  ___                    ___\r\n");
    debug_printf("   /  |/  /___ _      ______ _/ (_)\r\n");
    debug_printf("  / /|_/ / __ \\ | /| / / __ `/ / / \r\n");
    debug_printf(" / /  / / /_/ / |/ |/ / /_/ / / /  \r\n");
    debug_printf("/_/  /_/\\____/|__/|__/\\__, /_/_/   \r\n");
    debug_printf("                     /____/        \r\n");
    debug_printf("\r\n\r\n");
    debug_printf(" * Master USART (debug) initialized\r\n");
    LED_Init();
    debug_printf(" * LED initialized\r\n");
    TIM3_Init();
    HAL_TIM_PWM_Start(&TIM3_Handle, TIM_CHANNEL_4);    
    debug_printf(" * Timer3 (Beeper) initialized\r\n");
    TF4_Init();
    debug_printf(" * 24V switched on\r\n");
    PAC5223RESET_Init();
    debug_printf(" * PAC 5223 out of reset\r\n");
    PAC5210RESET_Init();
    debug_printf(" * PAC 5210 out of reset\r\n");    
    I2C_Init();
    debug_printf(" * Hard I2C (onboard Accelerometer) initialized\r\n");
    SW_I2C_Init();
    debug_printf(" * Soft I2C (J18) initialized\r\n");
    // test if we have something supported connected
    IMU_TestDevice();
    IMU_Init();

